There are two object types Pandas. They are 
1) Data Frame - Table of rows and columns. Each column is known as Pandas Series

In [2]:
import pandas as pd

In [6]:
# Read table documentation link - http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_table.html
orders = pd.read_table('chipotle.tsv')

In [ ]:
orders.head()

In [ ]:
#This is a pipe seperated table
pd.read_table('http://bit.ly/movieusers')

In [ ]:
#In order to convert pipe seperated table to readable table
#Another problem is first row is being read as header
pd.read_table('http://bit.ly/movieusers', sep='|')

In [ ]:
#To rectify header problem
pd.read_table('http://bit.ly/movieusers', sep='|', header=None)

In [ ]:
#To give column names
user_cols = ['Usernumber', 'Age', 'Gender', 'Designation', 'Pincode']
pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [18]:
user_cols = ['Usernumber', 'Age', 'Gender', 'Designation', 'Pincode']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [19]:
users.head()

   Usernumber  Age Gender Designation Pincode
0           1   24      M  technician   85711
1           2   53      F       other   94043
2           3   23      M      writer   32067
3           4   24      M  technician   43537
4           5   33      F       other   15213